; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-4-4-11)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p1-3 - location
	p1-5 - location
	p1-6 - location
	p2-0 - location
	p3-2 - location
	p3-4 - location
	p4-0 - location
	p4-6 - location
	p5-2 - location
	p5-4 - location
	p6-0 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s4)
	(at driver3 s6)
	(at driver4 s5)
	(at truck1 s2)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s6)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s3)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s0)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at package1 s3)
	(at package2 s3)
	(at package3 s2)
	(at package4 s5)
	(at package5 s5)
	(at package6 s5)
	(at package7 s1)
	(at package8 s2)
	(at package9 s3)
	(at package10 s2)
	(at package11 s5)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(path s1 p1-6)
	(path p1-6 s1)
	(path s6 p1-6)
	(path p1-6 s6)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(path s4 p4-6)
	(path p4-6 s4)
	(path s6 p4-6)
	(path p4-6 s6)
	(path s5 p5-2)
	(path p5-2 s5)
	(path s2 p5-2)
	(path p5-2 s2)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(path s6 p6-0)
	(path p6-0 s6)
	(path s0 p6-0)
	(path p6-0 s0)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 34)
	(= (time-to-drive s3 s0) 34)
	(link s0 s5)
	(link s5 s0)
	(= (time-to-drive s0 s5) 76)
	(= (time-to-drive s5 s0) 76)
	(link s0 s6)
	(link s6 s0)
	(= (time-to-drive s0 s6) 71)
	(= (time-to-drive s6 s0) 71)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 69)
	(= (time-to-drive s2 s1) 69)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 58)
	(= (time-to-drive s3 s2) 58)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 22)
	(= (time-to-drive s5 s2) 22)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 48)
	(= (time-to-drive s4 s3) 48)
	(link s3 s5)
	(link s5 s3)
	(= (time-to-drive s3 s5) 88)
	(= (time-to-drive s5 s3) 88)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 93)
	(= (time-to-drive s0 s4) 93)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 45)
	(= (time-to-drive s1 s4) 45)
	(link s4 s6)
	(link s6 s4)
	(= (time-to-drive s4 s6) 65)
	(= (time-to-drive s6 s4) 65)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 30)
	(= (time-to-drive s1 s5) 30)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 79)
	(= (time-to-drive s2 s6) 79)
	(link s6 s3)
	(link s3 s6)
	(= (time-to-drive s6 s3) 71)
	(= (time-to-drive s3 s6) 71)
	(link s6 s5)
	(link s5 s6)
	(= (time-to-drive s6 s5) 55)
	(= (time-to-drive s5 s6) 55)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s3)
	(at driver2 s2)
	(at driver4 s0)
	(at truck3 s2)
	(at truck4 s0)
	(at package1 s1)
	(at package2 s4)
	(at package3 s6)
	(at package4 s3)
	(at package5 s2)
	(at package6 s0)
	(at package7 s3)
	(at package8 s2)
	(at package9 s5)
	(at package10 s5)
	(at package11 s2)
	))

(:metric minimize (+ (* 4 (total-time)) (* 3 (fuel-used))))

)

; plan
1. (board-truck driver3 truck2 s6)
   deleted: (at driver3 s6) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 2 of 16
2. (walk driver1 s1 p1-3)
   deleted: (at driver1 s1)
   added: (at driver1 p1-3)
   goals met: 2 of 16
3. (walk driver1 p1-3 s3)
   deleted: (at driver1 p1-3)
   added: (at driver1 s3)
   goals met: 3 of 16
4. (drive-truck truck2 s6 s3 driver3)
   deleted: (at truck2 s6)
   added: (at truck2 s3)
   changed: (fuel-used) from 0 to 710
   goals met: 3 of 16
5. (load-truck package1 truck2 s3)
   deleted: (at package1 s3)
   added: (in package1 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 3 of 16
6. (load-truck package2 truck2 s3)
   deleted: (at package2 s3)
   added: (in package2 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 3 of 16
7. (load-truck package9 truck2 s3)
   deleted: (at package9 s3)
   added: (in package9 truck2)
   changed: (load truck2) from 2 to 3, (fuel-per-minute truck2) from 13 to 16
   goals met: 3 of 16
8. (drive-truck truck2 s3 s2 driver3)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   changed: (fuel-used) from 710 to 1638
   goals met: 3 of 16
9. (drive-truck truck2 s2 s1 driver3)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   changed: (fuel-used) from 1638 to 2742
   goals met: 3 of 16
10. (unload-truck package1 truck2 s1)
   deleted: (in package1 truck2)
   added: (at package1 s1)
   changed: (load truck2) from 3 to 2, (fuel-per-minute truck2) from 16 to 13
   goals met: 4 of 16
11. (load-truck package7 truck2 s1)
   deleted: (at package7 s1)
   added: (in package7 truck2)
   changed: (load truck2) from 2 to 3, (fuel-per-minute truck2) from 13 to 16
   goals met: 4 of 16
12. (drive-truck truck2 s1 s2 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   changed: (fuel-used) from 2742 to 3846
   goals met: 4 of 16
13. (drive-truck truck2 s2 s3 driver3)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   changed: (fuel-used) from 3846 to 4774
   goals met: 4 of 16
14. (unload-truck package7 truck2 s3)
   deleted: (in package7 truck2)
   added: (at package7 s3)
   changed: (load truck2) from 3 to 2, (fuel-per-minute truck2) from 16 to 13
   goals met: 5 of 16
15. (board-truck driver1 truck3 s3)
   deleted: (at driver1 s3) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 4 of 16
16. (drive-truck truck2 s3 s2 driver3)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   changed: (fuel-used) from 4774 to 5528
   goals met: 4 of 16
17. (load-truck package10 truck2 s2)
   deleted: (at package10 s2)
   added: (in package10 truck2)
   changed: (load truck2) from 2 to 3, (fuel-per-minute truck2) from 13 to 16
   goals met: 4 of 16
18. (drive-truck truck2 s2 s3 driver3)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   changed: (fuel-used) from 5528 to 6456
   goals met: 4 of 16
19. (drive-truck truck3 s3 s2 driver1)
   deleted: (at truck3 s3)
   added: (at truck3 s2)
   changed: (fuel-used) from 6456 to 7036
   goals met: 5 of 16
20. (load-truck package3 truck3 s2)
   deleted: (at package3 s2)
   added: (in package3 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 5 of 16
21. (drive-truck truck3 s2 s3 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s3)
   changed: (fuel-used) from 7036 to 7674
   goals met: 4 of 16
22. (drive-truck truck2 s3 s0 driver3)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   changed: (fuel-used) from 7674 to 8218
   goals met: 4 of 16
23. (drive-truck truck3 s3 s6 driver1)
   deleted: (at truck3 s3)
   added: (at truck3 s6)
   changed: (fuel-used) from 8218 to 8999
   goals met: 4 of 16
24. (unload-truck package3 truck3 s6)
   deleted: (in package3 truck3)
   added: (at package3 s6)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 5 of 16
25. (drive-truck truck3 s6 s3 driver1)
   deleted: (at truck3 s6)
   added: (at truck3 s3)
   changed: (fuel-used) from 8999 to 9709
   goals met: 5 of 16
26. (drive-truck truck2 s0 s4 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s4)
   changed: (fuel-used) from 9709 to 11197
   goals met: 5 of 16
27. (unload-truck package2 truck2 s4)
   deleted: (in package2 truck2)
   added: (at package2 s4)
   changed: (load truck2) from 3 to 2, (fuel-per-minute truck2) from 16 to 13
   goals met: 6 of 16
28. (drive-truck truck2 s4 s1 driver3)
   deleted: (at truck2 s4)
   added: (at truck2 s1)
   changed: (fuel-used) from 11197 to 11782
   goals met: 6 of 16
29. (drive-truck truck2 s1 s5 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s5)
   changed: (fuel-used) from 11782 to 12172
   goals met: 6 of 16
30. (unload-truck package9 truck2 s5)
   deleted: (in package9 truck2)
   added: (at package9 s5)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 7 of 16
31. (unload-truck package10 truck2 s5)
   deleted: (in package10 truck2)
   added: (at package10 s5)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 8 of 16
32. (load-truck package4 truck2 s5)
   deleted: (at package4 s5)
   added: (in package4 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 8 of 16
33. (load-truck package5 truck2 s5)
   deleted: (at package5 s5)
   added: (in package5 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 8 of 16
34. (load-truck package11 truck2 s5)
   deleted: (at package11 s5)
   added: (in package11 truck2)
   changed: (load truck2) from 2 to 3, (fuel-per-minute truck2) from 13 to 16
   goals met: 8 of 16
35. (disembark-truck driver3 truck2 s5)
   deleted: (driving driver3 truck2)
   added: (at driver3 s5) (empty truck2)
   goals met: 8 of 16
36. (board-truck driver4 truck2 s5)
   deleted: (at driver4 s5) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 8 of 16
37. (load-truck package6 truck2 s5)
   deleted: (at package6 s5)
   added: (in package6 truck2)
   changed: (load truck2) from 3 to 4, (fuel-per-minute truck2) from 16 to 20
   goals met: 8 of 16
38. (drive-truck truck2 s5 s3 driver4)
   deleted: (at truck2 s5)
   added: (at truck2 s3)
   changed: (fuel-used) from 12172 to 13932
   goals met: 8 of 16
39. (unload-truck package4 truck2 s3)
   deleted: (in package4 truck2)
   added: (at package4 s3)
   changed: (load truck2) from 4 to 3, (fuel-per-minute truck2) from 20 to 16
   goals met: 9 of 16
40. (disembark-truck driver1 truck3 s3)
   deleted: (driving driver1 truck3)
   added: (at driver1 s3) (empty truck3)
   goals met: 10 of 16
41. (drive-truck truck2 s3 s0 driver4)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   changed: (fuel-used) from 13932 to 14476
   goals met: 10 of 16
42. (unload-truck package6 truck2 s0)
   deleted: (in package6 truck2)
   added: (at package6 s0)
   changed: (load truck2) from 3 to 2, (fuel-per-minute truck2) from 16 to 13
   goals met: 11 of 16
43. (board-truck driver1 truck3 s3)
   deleted: (at driver1 s3) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 10 of 16
44. (drive-truck truck2 s0 s5 driver4)
   deleted: (at truck2 s0)
   added: (at truck2 s5)
   changed: (fuel-used) from 14476 to 15464
   goals met: 10 of 16
45. (drive-truck truck2 s5 s2 driver4)
   deleted: (at truck2 s5)
   added: (at truck2 s2)
   changed: (fuel-used) from 15464 to 15750
   goals met: 10 of 16
46. (unload-truck package5 truck2 s2)
   deleted: (in package5 truck2)
   added: (at package5 s2)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 11 of 16
47. (disembark-truck driver4 truck2 s2)
   deleted: (driving driver4 truck2)
   added: (at driver4 s2) (empty truck2)
   goals met: 11 of 16
48. (walk driver4 s2 p2-0)
   deleted: (at driver4 s2)
   added: (at driver4 p2-0)
   goals met: 11 of 16
49. (walk driver4 p2-0 s0)
   deleted: (at driver4 p2-0)
   added: (at driver4 s0)
   goals met: 12 of 16
50. (drive-truck truck3 s3 s4 driver1)
   deleted: (at truck3 s3)
   added: (at truck3 s4)
   changed: (fuel-used) from 15750 to 16230
   goals met: 12 of 16
51. (disembark-truck driver1 truck3 s4)
   deleted: (driving driver1 truck3)
   added: (at driver1 s4) (empty truck3)
   goals met: 12 of 16
52. (board-truck driver2 truck3 s4)
   deleted: (at driver2 s4) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 12 of 16
53. (unload-truck package11 truck2 s2)
   deleted: (in package11 truck2)
   added: (at package11 s2)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 13 of 16
54. (walk driver1 s4 p3-4)
   deleted: (at driver1 s4)
   added: (at driver1 p3-4)
   goals met: 13 of 16
55. (walk driver1 p3-4 s3)
   deleted: (at driver1 p3-4)
   added: (at driver1 s3)
   goals met: 14 of 16
56. (drive-truck truck3 s4 s3 driver2)
   deleted: (at truck3 s4)
   added: (at truck3 s3)
   changed: (fuel-used) from 16230 to 16710
   goals met: 14 of 16
57. (drive-truck truck3 s3 s2 driver2)
   deleted: (at truck3 s3)
   added: (at truck3 s2)
   changed: (fuel-used) from 16710 to 17290
   goals met: 15 of 16
58. (disembark-truck driver2 truck3 s2)
   deleted: (driving driver2 truck3)
   added: (at driver2 s2) (empty truck3)
   goals met: 16 of 16
